; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_26)

(:domain logistics)

(:objects
	obj0 obj3 obj5 - airport
	obj1 obj4 obj6 - city
	obj2 obj18 obj19 obj21 - location
	obj7 obj8 obj9 obj10 obj11 - truck
	obj12 obj13 obj14 obj15 obj17 obj20 obj22 - package
	obj16 - airplane
)

(:init
	(at obj7 obj0)
	(at obj8 obj5)
	(at obj9 obj3)
	(at obj10 obj3)
	(at obj11 obj3)
	(at obj12 obj0)
	(at obj13 obj5)
	(at obj14 obj3)
	(at obj15 obj3)
	(at obj16 obj3)
	(at obj17 obj3)
	(at obj20 obj0)
	(at obj22 obj3)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj4)
	(in-city obj5 obj6)
	(in-city obj18 obj6)
	(in-city obj19 obj4)
	(in-city obj21 obj6)
)

(:goal (and
	(at obj12 obj21)
	(at obj13 obj2)
	(at obj14 obj19)
	(at obj15 obj2)
	(at obj17 obj2)
	(at obj20 obj19)
	(at obj22 obj18)
))
)

; plan
1. (drive obj10 obj3 obj19)
   deleted: (at obj10 obj3)
   added: (at obj10 obj19)
   goals met: 0 of 7
2. (drive obj7 obj0 obj2)
   deleted: (at obj7 obj0)
   added: (at obj7 obj2)
   goals met: 0 of 7
3. (drive obj8 obj5 obj21)
   deleted: (at obj8 obj5)
   added: (at obj8 obj21)
   goals met: 0 of 7
4. (load obj16 obj14 obj3)
   deleted: (at obj14 obj3)
   added: (in obj14 obj16)
   goals met: 0 of 7
5. (load obj16 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj16)
   goals met: 0 of 7
6. (load obj16 obj17 obj3)
   deleted: (at obj17 obj3)
   added: (in obj17 obj16)
   goals met: 0 of 7
7. (load obj16 obj22 obj3)
   deleted: (at obj22 obj3)
   added: (in obj22 obj16)
   goals met: 0 of 7
8. (fly obj16 obj3 obj0)
   deleted: (at obj16 obj3)
   added: (at obj16 obj0)
   goals met: 0 of 7
9. (drive obj8 obj21 obj18)
   deleted: (at obj8 obj21)
   added: (at obj8 obj18)
   goals met: 0 of 7
10. (load obj16 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj16)
   goals met: 0 of 7
11. (load obj16 obj20 obj0)
   deleted: (at obj20 obj0)
   added: (in obj20 obj16)
   goals met: 0 of 7
12. (fly obj16 obj0 obj5)
   deleted: (at obj16 obj0)
   added: (at obj16 obj5)
   goals met: 0 of 7
13. (drive obj7 obj2 obj0)
   deleted: (at obj7 obj2)
   added: (at obj7 obj0)
   goals met: 0 of 7
14. (drive obj9 obj3 obj19)
   deleted: (at obj9 obj3)
   added: (at obj9 obj19)
   goals met: 0 of 7
15. (load obj16 obj13 obj5)
   deleted: (at obj13 obj5)
   added: (in obj13 obj16)
   goals met: 0 of 7
16. (fly obj16 obj5 obj0)
   deleted: (at obj16 obj5)
   added: (at obj16 obj0)
   goals met: 0 of 7
17. (drive obj7 obj0 obj2)
   deleted: (at obj7 obj0)
   added: (at obj7 obj2)
   goals met: 0 of 7
18. (fly obj16 obj0 obj5)
   deleted: (at obj16 obj0)
   added: (at obj16 obj5)
   goals met: 0 of 7
19. (drive obj10 obj19 obj3)
   deleted: (at obj10 obj19)
   added: (at obj10 obj3)
   goals met: 0 of 7
20. (drive obj11 obj3 obj19)
   deleted: (at obj11 obj3)
   added: (at obj11 obj19)
   goals met: 0 of 7
21. (drive obj7 obj2 obj0)
   deleted: (at obj7 obj2)
   added: (at obj7 obj0)
   goals met: 0 of 7
22. (drive obj8 obj18 obj5)
   deleted: (at obj8 obj18)
   added: (at obj8 obj5)
   goals met: 0 of 7
23. (drive obj9 obj19 obj3)
   deleted: (at obj9 obj19)
   added: (at obj9 obj3)
   goals met: 0 of 7
24. (fly obj16 obj5 obj3)
   deleted: (at obj16 obj5)
   added: (at obj16 obj3)
   goals met: 0 of 7
25. (drive obj10 obj3 obj19)
   deleted: (at obj10 obj3)
   added: (at obj10 obj19)
   goals met: 0 of 7
26. (drive obj11 obj19 obj3)
   deleted: (at obj11 obj19)
   added: (at obj11 obj3)
   goals met: 0 of 7
27. (drive obj7 obj0 obj2)
   deleted: (at obj7 obj0)
   added: (at obj7 obj2)
   goals met: 0 of 7
28. (drive obj9 obj3 obj19)
   deleted: (at obj9 obj3)
   added: (at obj9 obj19)
   goals met: 0 of 7
29. (unload obj16 obj14 obj3)
   deleted: (in obj14 obj16)
   added: (at obj14 obj3)
   goals met: 0 of 7
30. (unload obj16 obj20 obj3)
   deleted: (in obj20 obj16)
   added: (at obj20 obj3)
   goals met: 0 of 7
31. (fly obj16 obj3 obj5)
   deleted: (at obj16 obj3)
   added: (at obj16 obj5)
   goals met: 0 of 7
32. (drive obj11 obj3 obj19)
   deleted: (at obj11 obj3)
   added: (at obj11 obj19)
   goals met: 0 of 7
33. (drive obj9 obj19 obj3)
   deleted: (at obj9 obj19)
   added: (at obj9 obj3)
   goals met: 0 of 7
34. (unload obj16 obj12 obj5)
   deleted: (in obj12 obj16)
   added: (at obj12 obj5)
   goals met: 0 of 7
35. (unload obj16 obj22 obj5)
   deleted: (in obj22 obj16)
   added: (at obj22 obj5)
   goals met: 0 of 7
36. (fly obj16 obj5 obj0)
   deleted: (at obj16 obj5)
   added: (at obj16 obj0)
   goals met: 0 of 7
37. (drive obj10 obj19 obj3)
   deleted: (at obj10 obj19)
   added: (at obj10 obj3)
   goals met: 0 of 7
38. (drive obj7 obj2 obj0)
   deleted: (at obj7 obj2)
   added: (at obj7 obj0)
   goals met: 0 of 7
39. (load obj8 obj12 obj5)
   deleted: (at obj12 obj5)
   added: (in obj12 obj8)
   goals met: 0 of 7
40. (load obj8 obj22 obj5)
   deleted: (at obj22 obj5)
   added: (in obj22 obj8)
   goals met: 0 of 7
41. (unload obj16 obj13 obj0)
   deleted: (in obj13 obj16)
   added: (at obj13 obj0)
   goals met: 0 of 7
42. (unload obj16 obj15 obj0)
   deleted: (in obj15 obj16)
   added: (at obj15 obj0)
   goals met: 0 of 7
43. (unload obj16 obj17 obj0)
   deleted: (in obj17 obj16)
   added: (at obj17 obj0)
   goals met: 0 of 7
44. (drive obj8 obj5 obj21)
   deleted: (at obj8 obj5)
   added: (at obj8 obj21)
   goals met: 0 of 7
45. (fly obj16 obj0 obj3)
   deleted: (at obj16 obj0)
   added: (at obj16 obj3)
   goals met: 0 of 7
46. (load obj7 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj7)
   goals met: 0 of 7
47. (load obj7 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj7)
   goals met: 0 of 7
48. (load obj7 obj17 obj0)
   deleted: (at obj17 obj0)
   added: (in obj17 obj7)
   goals met: 0 of 7
49. (load obj9 obj14 obj3)
   deleted: (at obj14 obj3)
   added: (in obj14 obj9)
   goals met: 0 of 7
50. (load obj9 obj20 obj3)
   deleted: (at obj20 obj3)
   added: (in obj20 obj9)
   goals met: 0 of 7
51. (unload obj8 obj12 obj21)
   deleted: (in obj12 obj8)
   added: (at obj12 obj21)
   goals met: 1 of 7
52. (drive obj7 obj0 obj2)
   deleted: (at obj7 obj0)
   added: (at obj7 obj2)
   goals met: 1 of 7
53. (drive obj8 obj21 obj18)
   deleted: (at obj8 obj21)
   added: (at obj8 obj18)
   goals met: 1 of 7
54. (drive obj9 obj3 obj19)
   deleted: (at obj9 obj3)
   added: (at obj9 obj19)
   goals met: 1 of 7
55. (drive obj10 obj3 obj19)
   deleted: (at obj10 obj3)
   added: (at obj10 obj19)
   goals met: 1 of 7
56. (drive obj11 obj19 obj3)
   deleted: (at obj11 obj19)
   added: (at obj11 obj3)
   goals met: 1 of 7
57. (unload obj7 obj13 obj2)
   deleted: (in obj13 obj7)
   added: (at obj13 obj2)
   goals met: 2 of 7
58. (unload obj7 obj15 obj2)
   deleted: (in obj15 obj7)
   added: (at obj15 obj2)
   goals met: 3 of 7
59. (unload obj7 obj17 obj2)
   deleted: (in obj17 obj7)
   added: (at obj17 obj2)
   goals met: 4 of 7
60. (unload obj8 obj22 obj18)
   deleted: (in obj22 obj8)
   added: (at obj22 obj18)
   goals met: 5 of 7
61. (unload obj9 obj14 obj19)
   deleted: (in obj14 obj9)
   added: (at obj14 obj19)
   goals met: 6 of 7
62. (unload obj9 obj20 obj19)
   deleted: (in obj20 obj9)
   added: (at obj20 obj19)
   goals met: 7 of 7
